In [10]:
import pandas as pd
import numpy as np

Series(1 Dimensional) and Dataframes(n-dimensional)

Heterogeneous data types and vectorisation using pandas the advantage over python list

In [2]:
pd.Series([0,1,2,3,4,5])

0    0
1    1
2    2
3    3
4    4
5    5
dtype: int64

In [3]:
d={'a':1,'b':2,'c':3}
pd.Series(d)

a    1
b    2
c    3
dtype: int64

In [4]:
d[0]

KeyError: 0

In [5]:
s1=pd.Series(d)

In [6]:
s1[0]

1

In [7]:
d['a']

1

In [8]:
s1['a']

1

In [11]:
a=np.arange(1,21)

In [12]:
s2=pd.Series(a)

In [13]:
s2

0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9     10
10    11
11    12
12    13
13    14
14    15
15    16
16    17
17    18
18    19
19    20
dtype: int32

In [15]:
s2[s2>10]
s2[::-1]

19    20
18    19
17    18
16    17
15    16
14    15
13    14
12    13
11    12
10    11
9     10
8      9
7      8
6      7
5      6
4      5
3      4
2      3
1      2
0      1
dtype: int32

In [16]:
d1={'id':['a','b','c'],'fruits':['apple','orange','banana']}

In [17]:
df1=pd.DataFrame(d1)

In [18]:
df1

  id  fruits
0  a   apple
1  b  orange
2  c  banana

can't access data simply. Use loc or iloc

In [19]:
df1.iloc[0,0]

'a'

In [20]:
df1.loc[0,'id']

'a'

In [46]:
d2={'id':['a','b','d'],'fruits':['tea','coffee','milk']}

In [47]:
df2=pd.DataFrame(d2)

In [27]:
df3=df1.append(df2,ignore_index=True)

C:\Users\ragha\AppData\Local\Temp\ipykernel_135144\3288388708.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df3=df1.append(df2,ignore_index=True)

In [28]:
df3.loc[0,'id']

'a'

In [29]:
df3.iloc[0,0]

'a'

In [30]:
df1

  id  fruits
0  a   apple
1  b  orange
2  c  banana

In [36]:
df2

  id   drink
0  a     tea
1  b  coffee
2  d    milk

In [37]:
pd.merge(df1,df2)

  id  fruits   drink
0  a   apple     tea
1  b  orange  coffee

In [38]:
pd.merge(df1,df2,how='outer')

  id  fruits   drink
0  a   apple     tea
1  b  orange  coffee
2  c  banana     NaN
3  d     NaN    milk

In [39]:
pd.merge(df1,df2,how='left')

  id  fruits   drink
0  a   apple     tea
1  b  orange  coffee
2  c  banana     NaN

In [40]:
pd.merge(df1,df2,how='right')

  id  fruits   drink
0  a   apple     tea
1  b  orange  coffee
2  d     NaN    milk

In [43]:
pd.merge(df1,df2,left_on='id',right_on="ide")

  id  fruits ide   drink
0  a   apple   a     tea
1  b  orange   b  coffee

In [44]:
df1

  id  fruits
0  a   apple
1  b  orange
2  c  banana

In [48]:
df2

  id  fruits
0  a     tea
1  b  coffee
2  d    milk

In [49]:
pd.merge(df1,df2,on='id')

  id fruits_x fruits_y
0  a    apple      tea
1  b   orange   coffee